package module12.homework.initialCode;

public class Main {

    public static void main(String[] args) throws InterruptedException {

        // 1. Создайте новых работников и примите их на работу (запустите 4 потока)

        // 2. Не забудьте отписаться, что все работники запустили на службу.

        // 3. Подождите одну рабочую неделю (12 секунд) и сообщите, когда рабочая неделя подойдет к концу

        // 4. Проверьте, сколько заданий выполнил каждый сотрудник (метод printCompletedTasks)

        // 5. Увольте всех сотрудников и сообщите боссу, что все уволены.
    }

}